[
    {
      "id": 1,
      "name": "HRMS - Human Resource Management System for Government Employees",
      "short_description": "A human resource management system developed for government departments to manage employee data, leave, payroll, and reporting.",
      "images": [
        "hrmms.png"
      ],
      "client" : "Telenagna Govt",
    "description" : [
      "Centralized platform for managing all employee-related records within government departments.",
      "Module for adding and managing employee profiles including personal, contact, designation, and joining details.",
      "Family details section to maintain spouse, children, and dependent records for benefits and service-related documentation.",
      "Nominee management for pension, insurance, and service-related claims.",
      "Leave management module where employees can apply for various leave types (casual, earned, medical), view balances, and track status.",
      "HR/Admin approval workflows for leave applications with notifications to concerned officers.",
      "Resignation module for employees to submit resignation requests with reasons, exit date, and withdrawal options before approval.",
      "Role-based login system for Admin, HR, and Employees with different privileges and dashboards.",
      "Audit trail and history log for tracking changes in employee data and leave transactions.",
      "Responsive and user-friendly dashboard showing employee attendance, recent leave applications, upcoming events, and alerts.",
      "Security features with  authentication, middleware protections, and encrypted data storage.",
      "Option to generate reports like leave summary, department-wise employee count, resignation trends, etc.",
      "Fully integrated with email notifications for important actions like leave approval/rejection and resignation status.",
      "Expandable system architecture allowing future modules like payroll, promotion history, ACR/annual review, etc."
    ],
      "frontend_technology": "Angular,Bootstrap, HTML ",
      "backend_technology": "Laravel ,Postgres Sql",
      "other_technology": "REST API ,JWT ,Docker",
      "number_of_clients": "10lakh",
      "deployment": {
        "environment": "Linux Server",
        "tools": ["Apache", "CI/CD", "Git"]
      }
    },

    {
      "id": 2,
      "name": "E-commerce CMS Portal",
      "description": "A customizable content management system for managing products, orders, and payments.",
      "images": [
        "images/cms1.png",
        "images/cms2.png"
      ],
      "frontend_technology": ["React", "Tailwind CSS"],
      "backend_technology": ["Node.js", "MongoDB"],
      "other_technology": ["Stripe Integration", "Firebase"],
      "number_of_clients": 3,
      "deployment": {
        "environment": "AWS",
        "tools": ["Nginx", "Docker", "PM2"]
      }
    }
  ]
  